Tutorials/nestedSolvers/nestedImpBlendDsPimpleFoam/nestedStaggeredCubes/mst/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.25  -0.175 0.0)
    ( 1.05 -0.175 0.0)
    ( 1.05  0.025 0.0)
    (-0.25   0.025 0.0)
    (-0.25  -0.175 0.3)
    ( 1.05 -0.175 0.3)
    ( 1.05  0.025 0.3)
    (-0.25   0.025 0.3)

);


blocks
(
    hex (0 1 2 3 4 5 6 7) (104 16 24) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    ground
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    top
    {
        type symmetryPlane;
        faces
        (
            (4 5 6 7)
        );
    }
    side1
    {
        type cyclic;
        neighbourPatch side2;
        faces
        (
            (0 1 5 4)
        );
    }
    side2
    {
        type cyclic;
        neighbourPatch side1;
        faces
        (
            (3 7 6 2)
        );
    }
);

// ************************************************************************* //
