Tutorials/nestedSolvers/nestedImpBlendDsPimpleFoam/nestedStaggeredCubes/mst/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


libs 
(
    "libLEMOSinflowMod.so"
    "libnestedBlendedVelocity.so"
//     "libdynamicSmagorinskyModel.so"
);

application     nestedImpBlendDsPimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.12;

deltaT          0.00012;

writeControl    adjustableRunTime;

writeInterval   0.012;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      general;

timePrecision   8;

runTimeModifiable false;

// functions objects executed at each mst timestep.
functions
{
    #include "runTimeFunctions/fieldAverage"
}

// ************************************************************************* //

