Tutorials/nestedSolvers/nestedImpBlendDsPimpleFoam/nestedStaggeredCubes/mst/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
      p
      {
      solver           GAMG;
      tolerance        1e-7;
      relTol           0.01;
      smoother         DICGaussSeidel;
      cacheAgglomeration true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      }

      pFinal
      {
      solver           GAMG;
      tolerance        1e-7;
      relTol           0;
      smoother         DICGaussSeidel;
      cacheAgglomeration true;
      nCellsInCoarsestLevel 10;
      agglomerator     faceAreaPair;
      mergeLevels      1;
      }

    "(U|k|B|nuTilda|nuSgs|T)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|B|nuTilda|nuSgs|T)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
    
    "(Srb1_.*|Srb2_.*)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(Srb1_.*|Srb2_.*)Final"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-6;
        relTol          0;
    }
}

// PISO
// {
//     nCorrectors     2;
//     nNonOrthogonalCorrectors 0;
// }

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// relaxationFactors
// {
//     fields
//     {
//         "(U|k|B|nuTilda|T)" 0.5;
//         "(U|k|B|nuTilda|T)Final" 1;
//     }
//     equations
//     {
//         "(U|k|B|nuTilda|T)" 0.5;
//         "(U|k|B|nuTilda|T)Final" 1;
//     }
// }

// ************************************************************************* //
