Tutorials/nestedSolvers/nestedImpBlendDsPimpleFoam/nestedStaggeredCubes/mst/system/runTimeFunctions/probesCL5
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

probesCL5
{
    type            probes;
    functionObjectLibs ("libsampling.so");
    enabled         true;
    outputControl   timeStep;
    outputInterval  1;
    region          region0;

    fields
    (
        U
        p
    );

    probeLocations
    (
        ( 0.42503 -0.075003 0.05 )
        ( 0.42503 -0.075003 0.055 )
        ( 0.42503 -0.075003 0.06 )
        ( 0.42503 -0.075003 0.065 )
        ( 0.42503 -0.075003 0.07 )
        ( 0.42503 -0.075003 0.075 )
        ( 0.42503 -0.075003 0.08 )
        ( 0.42503 -0.075003 0.085 )
        ( 0.42503 -0.075003 0.09 )
        ( 0.42503 -0.075003 0.095 )
        ( 0.42503 -0.075003 0.1 )
        ( 0.42503 -0.075003 0.105 )
        ( 0.42503 -0.075003 0.11 )
        ( 0.42503 -0.075003 0.115 )
        ( 0.42503 -0.075003 0.12 )
        ( 0.42503 -0.075003 0.125 )
        ( 0.42503 -0.075003 0.13 )
        ( 0.42503 -0.075003 0.135 )
        ( 0.42503 -0.075003 0.14 )
        ( 0.42503 -0.075003 0.145 )
        ( 0.42503 -0.075003 0.15 )
        ( 0.42503 -0.075003 0.155 )
        ( 0.42503 -0.075003 0.16 )
        ( 0.42503 -0.075003 0.165 )
        ( 0.42503 -0.075003 0.17 )
        ( 0.42503 -0.075003 0.175 )
        ( 0.42503 -0.075003 0.18 )
        ( 0.42503 -0.075003 0.185 )
        ( 0.42503 -0.075003 0.19 )
        ( 0.42503 -0.075003 0.195 )
        ( 0.42503 -0.075003 0.2 )
        ( 0.42503 -0.075003 0.205 )
        ( 0.42503 -0.075003 0.21 )
        ( 0.42503 -0.075003 0.215 )
        ( 0.42503 -0.075003 0.22 )
        ( 0.42503 -0.075003 0.225 )
        ( 0.42503 -0.075003 0.23 )
        ( 0.42503 -0.075003 0.235 )
        ( 0.42503 -0.075003 0.24 )
        ( 0.42503 -0.075003 0.245 )
        ( 0.42503 -0.075003 0.25 )   
    );

}

/*---------------------------------------------------------------------------*/
