Tutorials/nestedSolvers/nestedImpBlendDsPimpleFoam/nestedStaggeredCubes/mst/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            false;
addLayers       false;

// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    cubes.stl
    {
        type triSurfaceMesh;
        name cubes;
    }    
    boxLevel01    //refinement up to 8 cells/h
    {
        type searchableBox;
        min (-0.25  -0.175 0.0);
        max ( 1.05  0.025 0.20);
    }
    boxLevel02    //refinement up to 16 cells/h
    {
        type searchableBox;
        min (-0.25  -0.175 0.0);
        max ( 1.05  0.025 0.10);
    }
    boxLevel03    //refinement up to 32 cells/h
    {
        type searchableBox;
        min (-0.05  -0.175 0.0);
        max ( 0.65  0.025 0.075);
    }
    groundBoxLevel03    //refinement up to 32 cells/h
    {
        type searchableBox;
        min (-0.25  -0.175 0.0);
        max ( 1.05  0.025 0.00625);
    }
    groundBoxLevel04    //refinement up to 64 cells/h
    {
        type searchableBox;
        min (-0.25  -0.175 0.0);
        max ( 0.65  0.025 0.003126);
    }

    topBoxLevel04    //refinement up to 64 cells/h
    {
        type searchableBox;
        min (-0.00625 -0.20625 0.04375);
        max (0.55625 0.05625 0.05625);
    }
    
    #include "snappy_boxCxxLevel2"
    #include "snappy_boxCxxLevel3"
    #include "snappy_boxCxxLevel4"
    #include "snappy_boxCxxLevel5"

};

// Settings for the castellatedMesh generation.
castellatedMeshControls
{

    // Refinement parameters
    // ~~~~~~~~~~~~~~~~~~~~~

    // If local number of cells is >= maxLocalCells on any processor
    // switches from from refinement followed by balancing
    // (current method) to (weighted) balancing before refinement.
    maxLocalCells 10000000;

    // Overall cell limit (approximately). Refinement will stop immediately
    // upon reaching this number so a refinement level might not complete.
    // Note that this is the number of cells before removing the part which
    // is not 'visible' from the keepPoint. The final number of cells might
    // actually be a lot less.
    maxGlobalCells 200000000;

    // The surface refinement loop might spend lots of iterations refining just a
    // few cells. This setting will cause refinement to stop if <= minimumRefine
    // are selected for refinement. Note: it will at least do one iteration
    // (unless the number of cells to refine is 0)
    minRefinementCells 0;

    // Allow a certain level of imbalance during refining
    // (since balancing is quite expensive)
    // Expressed as fraction of perfect balance (= overall number of cells /
    // nProcs). 0=balance always.
    maxLoadUnbalance 0.10;

    // Number of buffer layers between different levels.
    // 1 means normal 2:1 refinement restriction, larger means slower
    // refinement.
    nCellsBetweenLevels 1;


    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by explicitly provided
    // edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    // Specify 'levels' in the same way as the 'distance' mode in the
    // refinementRegions (see below). The old specification
    //      level   2;
    // is equivalent to
    //      levels  ((0 2));

    features
    (
//         {
//            file "cubes.eMesh";
//            level 0;
//         }
    );


    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        cubes
        {
            level (2 2); // Surface-wise min and max refinement level
        }
    }

    // Feature angle:
    // - used if min and max refinement level of a surface differ
    // - used if feature snapping (see snapControls below) is used
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   increasing order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
        boxLevel01        //refinement up to 8 cells/h
        {
            mode inside;
            levels ((1 1));
        }
//         boxLevel02         //refinement up to 16 cells/h
//         {
//             mode inside;
//             levels ((2 2));
//         }
//         boxLevel03          //refinement up to 32 cells/h
//         {
//             mode inside;
//             levels ((3 3));
//         }
        
        
//         groundBoxLevel03       //refinement up to 32 cells/h
//         {
//             mode inside;
//             levels ((3 3));
//         }
//         groundBoxLevel04    //refinement up to 64 cells/h
//         {
//             mode inside;
//             levels ((4 4));
//         }
//         
//         
//         topBoxLevel04    //refinement up to 64 cells/h
//         {
//             mode inside;
//             levels ((4 4));
//         }
// 
//         
//      


        boxC11Level02      
        {
            mode inside;
            levels ((2 2));
        }
        "(boxC11Level02|boxC12Level02|boxC13Level02)"      
        {
            mode inside;
            levels ((2 2));
        }
        "(boxC21Level02|boxC22Level02|boxC23Level02)"      
        {
            mode inside;
            levels ((2 2));
        }
        "(boxC31Level02|boxC32Level02|boxC33Level02)"      
        {
            mode inside;
            levels ((2 2));
        }
        "(boxC41Level02|boxC42Level02|boxC43Level02)"      
        {
            mode inside;
            levels ((2 2));
        }
        "(boxC51Level02|boxC52Level02|boxC53Level02)"      
        {
            mode inside;
            levels ((2 2));
        }
        
        
//         "(boxC11Level03|boxC12Level03|boxC13Level03)"      
//         {
//             mode inside;
//             levels ((3 3));
//         }
//         "(boxC21Level03|boxC22Level03|boxC23Level03)"      
//         {
//             mode inside;
//             levels ((3 3));
//         }
//         "(boxC31Level03|boxC32Level03|boxC33Level03)"      
//         {
//             mode inside;
//             levels ((3 3));
//         }
//         "(boxC41Level03|boxC42Level03|boxC43Level03)"      
//         {
//             mode inside;
//             levels ((3 3));
//         }
//         "(boxC51Level03|boxC52Level03|boxC53Level03)"      
//         {
//             mode inside;
//             levels ((3 3));
//         }
        
        
        
//         "(boxC11Level04|boxC12Level04|boxC13Level04)"      
//         {
//             mode inside;
//             levels ((4 4));
//         }
//         "(boxC21Level04|boxC22Level04|boxC23Level04)"      
//         {
//             mode inside;
//             levels ((4 4));
//         }
//         "(boxC31Level04|boxC32Level04|boxC33Level04)"      
//         {
//             mode inside;
//             levels ((4 4));
//         }
//         "(boxC41Level04|boxC42Level04|boxC43Level04)"      
//         {
//             mode inside;
//             levels ((4 4));
//         }
//         "(boxC51Level04|boxC52Level04|boxC53Level04)"      
//         {
//             mode inside;
//             levels ((4 4));
//         }
        
        
        
//         "(boxC11Level05|boxC12Level05|boxC13Level05)"      
//         {
//             mode inside;
//             levels ((5 5));
//         }
//         "(boxC21Level05|boxC22Level05|boxC23Level05)"      
//         {
//             mode inside;
//             levels ((5 5));
//         }
//         "(boxC31Level05|boxC32Level05|boxC33Level05)"      
//         {
//             mode inside;
//             levels ((5 5));
//         }
//         "(boxC41Level05|boxC42Level05|boxC43Level05)"      
//         {
//             mode inside;
//             levels ((5 5));
//         }
//         "(boxC51Level05|boxC52Level05|boxC53Level05)"      
//         {
//             mode inside;
//             levels ((5 5));
//         }


    }

    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (0.00001 0.000002 0.07965601);

    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}

// Settings for the snapping.
snapControls
{
    // Number of patch smoothing iterations before finding correspondence
    // to surface
    nSmoothPatch 3;

    // Maximum relative distance for points to be attracted by surface.
    // True distance is this factor times local maximum edge length.
    // Note: changed(corrected) w.r.t 17x! (17x used 2* tolerance)
    tolerance 2.0;

    // Number of mesh displacement relaxation iterations.
    nSolveIter 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Feature snapping

        // Number of feature edge snapping iterations.
        // Leave out altogether to disable.
        nFeatureSnapIter 10;

        // Detect (geometric only) features by sampling the surface
        // (default=false).
        implicitFeatureSnap false;

        // Use castellatedMeshControls::features (default = true)
        explicitFeatureSnap true;

        // Detect features between multiple surfaces
        // (only for explicitFeatureSnap, default = false)
        multiRegionFeatureSnap false;
}

// Settings for the layer addition.
addLayersControls
{
    // Are the thickness parameters below relative to the undistorted
    // size of the refined cell outside layer (true) or absolute sizes (false).
    relativeSizes true;

    // Layer thickness specification. This can be specified in one of four ways
    // - expansionRatio and finalLayerThickness (cell nearest internal mesh)
    // - expansionRatio and firstLayerThickness (cell on surface)
    // - overall thickness and firstLayerThickness
    // - overall thickness and finalLayerThickness

        // Expansion factor for layer mesh
        expansionRatio 1.0;

        // Wanted thickness of the layer furthest away from the wall.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.
        finalLayerThickness 0.3;

        // Wanted thickness of the layer next to the wall.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.
        //firstLayerThickness 0.3;

        // Wanted overall thickness of layers.
        // If relativeSizes this is relative to undistorted size of cell
        // outside layer.
        //thickness 0.5


    // Minimum overall thickness of total layers. If for any reason layer
    // cannot be above minThickness do not add layer.
    // If relativeSizes this is relative to undistorted size of cell
    // outside layer..
    minThickness 0.25;


    // Per final patch (so not geometry!) the layer information
    // Note: This behaviour changed after 21x. Any non-mentioned patches
    //       now slide unless:
    //          - nSurfaceLayers is explicitly mentioned to be 0.
    //          - angle to nearest surface < slipFeatureAngle (see below)
    layers
    {
        sphere.stl_firstSolid
        {
            nSurfaceLayers 1;

        }
        maxY
        {
            nSurfaceLayers 1;
            // Per patch layer data
            expansionRatio      1.3;
            finalLayerThickness 0.3;
            minThickness        0.1;
        }

        // Disable any mesh shrinking and layer addition on any point of
        // a patch by setting nSurfaceLayers to 0
        frozenPatches
        {
            nSurfaceLayers 0;
        }
    }

    // If points get not extruded do nGrow layers of connected faces that are
    // also not grown. This helps convergence of the layer addition process
    // close to features.
    // Note: changed(corrected) w.r.t 17x! (didn't do anything in 17x)
    nGrow 0;

    // Advanced settings

    // When not to extrude surface. 0 is flat surface, 90 is when two faces
    // are perpendicular
    featureAngle 60;

    // At non-patched sides allow mesh to slip if extrusion direction makes
    // angle larger than slipFeatureAngle.
    slipFeatureAngle 30;

    // Maximum number of snapping relaxation iterations. Should stop
    // before upon reaching a correct mesh.
    nRelaxIter 5;

    // Number of smoothing iterations of surface normals
    nSmoothSurfaceNormals 1;

    // Number of smoothing iterations of interior mesh movement direction
    nSmoothNormals 3;

    // Smooth layer thickness over surface patches
    nSmoothThickness 10;

    // Stop layer growth on highly warped cells
    maxFaceThicknessRatio 0.5;

    // Reduce layer growth where ratio thickness to medial
    // distance is large
    maxThicknessToMedialRatio 0.3;

    // Angle used to pick up medial axis points
    // Note: changed(corrected) w.r.t 17x! 90 degrees corresponds to 130 in 17x.
    minMedianAxisAngle 90;

    // Create buffer region for new layer terminations
    nBufferCellsNoExtrude 0;

    // Overall max number of layer addition iterations. The mesher will exit
    // if it reaches this number of iterations; possibly with an illegal
    // mesh.
    nLayerIter 50;

    // Max number of iterations after which relaxed meshQuality controls
    // get used. Up to nRelaxedIter it uses the settings in
    // meshQualityControls,
    // after nRelaxedIter it uses the values in
    // meshQualityControls::relaxed.
    nRelaxedIter 20;

    // Additional reporting: if there are just a few faces where there
    // are mesh errors (after adding the layers) print their face centres.
    // This helps in tracking down problematic mesh areas.
    //additionalReporting true;
}

// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    // Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;

    // Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    // Max concaveness allowed. Is angle (in degrees) below which concavity
    // is allowed. 0 is straight face, <0 would be convex face.
    // Set to 180 to disable.
    maxConcave 80;

    // Minimum pyramid volume. Is absolute volume of cell pyramid.
    // Set to a sensible fraction of the smallest cell volume expected.
    // Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-13;

    // Minimum quality of the tet formed by the face-centre
    // and variable base point minimum decomposition triangles and
    // the cell centre. This has to be a positive number for tracking
    // to work. Set to very negative number (e.g. -1E30) to
    // disable.
    //    <0 = inside out tet,
    //     0 = flat tet
    //     1 = regular tet
    minTetQuality 1e-9;

    // Minimum face area. Set to <0 to disable.
    minArea -1;

    // Minimum face twist. Set to <-1 to disable. dot product of face normal
    // and face centre triangles normal
    minTwist 0.05;

    // minimum normalised cell determinant
    // 1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    // minFaceWeight (0 -> 0.5)
    minFaceWeight 0.05;

    // minVolRatio (0 -> 1)
    minVolRatio 0.01;

    // must be >0 for Fluent compatibility
    minTriangleTwist -1;

    //- if >0 : preserve single cells with all points on the surface if the
    //  resulting volume after snapping (by approximation) is larger than
    //  minVolCollapseRatio times old volume (i.e. not collapsed to flat cell).
    //  If <0 : delete always.
    //minVolCollapseRatio 0.5;

    // Advanced

    // Number of error distribution iterations
    nSmoothScale 4;
    // amount to scale back displacement at error points
    errorReduction 0.75;

    // Optional : some meshing phases allow usage of relaxed rules.
    // See e.g. addLayersControls::nRelaxedIter.
    relaxed
    {
        //- Maximum non-orthogonality allowed. Set to 180 to disable.
        maxNonOrtho 75;
    }
}

// Advanced

// Flags for optional output
// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;

// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;

// ************************************************************************* //
